app/controllers/crates_controller.rb

SELECT "crates".* FROM "crates"
---
  def index
    @crates = Crate.all

SELECT  "crates".* FROM "crates" WHERE "crates"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_crate
      @crate = Crate.find(params[:id])