app/controllers/songs_controller.rb

INSERT INTO "songs" ("artist", "title", "format", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["artist", "Darwin"], ["title", "tulititacati"], ["format", "mp3"], ["created_at", "2019-05-09 17:41:39.465609"], ["updated_at", "2019-05-09 17:41:39.465609"]]
---
  def create
    @song = Song.new(song_params)

    if @song.save

UPDATE "songs" SET "artist" = $1, "format" = $2, "updated_at" = $3 WHERE "songs"."id" = $4  [["artist", "Galbert"], ["format", "Prince"], ["updated_at", "2019-05-10 15:31:39.468639"], ["id", 1]]
---
  def update
    if @song.update(song_params)